import re
shortenedMap = {
    "창세기":"창",    "출애굽기":"출",    "레위기":"레",    "민수기":"민",    "신명기":"신",    "여호수아":"수",    "사사기":"삿",    "룻기":"룻",
    "사무엘상":"삼상",    "사무엘하":"삼하",    "열왕기상":"왕상",    "열왕기하":"왕하",    "역대상":"대상",    "역대하":"대하",    "에스라":"스",    "느헤미야":"느",
    "에스더":"에",    "욥기":"욥",    "시편":"시",    "잠언":"잠",    "전도서":"전",    "아가":"아",    "이사야":"사",    "예레미야":"렘",
    "예레미야애가":"애",    "에스겔":"겔",    "다니엘":"단",    "호세아":"호",    "요엘":"욜",    "아모스":"암",    "오바댜":"옵",    "요나":"욘",
    "미가":"미",    "나훔":"나",    "하박국":"합",    "스바냐":"습",    "학개":"학",    "스가랴":"슥",    "말라기":"말",
    "마태복음":"마", "마가복음":"막", "누가복음":"눅", "요한복음":"요", "사도행전":"행",
    "로마서":"롬", "고린도전서":"고전", "고린도후서":"고후", "갈라디아서":"갈", "에베소서":"엡",
    "빌립보서":"빌","골로새서":"골","데살로니가전서":"살전","데살로니가후서":"살후","디모데전서":"딤전",
    "디모데후서":"딤후","디도서":"딛","빌레몬서":"몬","히브리서":"히","야고보서":"약","베드로전서":"벧전",
    "베드로후서":"벧후","요한일서":"요일","요한이서":"요이","요한삼서":"요삼","요한계시록":"계"
}

def getAddr(text):
    r1 = re.sub("\(|\)", "", text)
    split1 = r1.split(" ")
    split2 = split1[1].split(":")
    split3 = split2[1]
    split4 = split3.split("~")

    book = split1[0]
    try:
        book = shortenedMap[split1[0]]
    except:
        print("error during shortened map", book)

    return {"book":book,
            "chapter":int(split2[0]),
            "verseFrom":int(split4[0]),
            "verseTo":int(split4[1])
            }
